Documents/ТК_Взаимозачет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ТК_Взаимозачет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПокупателями</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПокупателямиПоДокументам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентированныйУчет</Name>
					<Comment>Флаг отражения документа в регламентированном учете</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дебитор</Name>
					<Comment>Контрагент, который имеет долги перед нами</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кредитор</Name>
					<Comment>Контрагент, которому мы должны</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс валюты документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
					<Comment>Договора и сделки по которым выполняется взаимозачет</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоговорВзаиморасчетовДебитор</Name>
							<Comment>Договор взаиморасчетов дебитора</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорВзаиморасчетовКредитор</Name>
							<Comment>Договор взаиморасчетов кредитора</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СделкаДебитор</Name>
							<Comment>Сделка, по которой дебитор должен нам</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТипыСделок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СделкаКредитор</Name>
							<Comment>Сделка, по которой мы должны кредитору</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТипыСделок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма взаимозачета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
			<Comment>Виды договоров</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
					<Comment>Договоры с поставщиками</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Договоры с покупателями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комиссия</Name>
					<Comment>Договор комиссии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бонус</Name>
					<Comment>Договор начисления бонусов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Общий договор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпрощеннаяКомиссия</Name>
					<Comment>Упрощенная комиссия</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бартерный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ТК_Взаимозачет/Ext/ManagerModule.bsl
#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка,ДополнительныеСвойства);

	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаВтТаблицаСостав(Запрос, ТекстыЗапроса);
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);					
	ПартионныйУчет.ПодготовитьТаблицыВзаимозачета(Запрос,ДополнительныеСвойства);

КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка,ДополнительныеСвойства)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТК_Взаимозачет.Дата КАК Период,
	               |	ТК_Взаимозачет.Ссылка КАК Ссылка,
	               |	ТК_Взаимозачет.ХозОперация КАК ХозОперация,
	               |	ТК_Взаимозачет.Организация КАК Организация,
	               |	ТК_Взаимозачет.ПодразделениеКомпании КАК ПодразделениеКомпании,
	               |	ТК_Взаимозачет.ТорговаяПлощадка КАК ТорговаяПлощадка,
	               |	ТК_Взаимозачет.ВалютаДокумента КАК ВалютаДокумента,
	               |	ТК_Взаимозачет.МоментВремени КАК МоментВремени,
	               |	ТК_Взаимозачет.РегламентированныйУчет КАК РегламентированныйУчет,
	               |	ТК_Взаимозачет.СуммаДокумента КАК СуммаДокумента,
	               |	ТК_Взаимозачет.Дебитор КАК Дебитор,
	               |	ТК_Взаимозачет.Кредитор КАК Кредитор,
	               |	ТК_Взаимозачет.КурсДокумента КАК КурсДокумента
	               |ИЗ
	               |	Документ.ТК_Взаимозачет КАК ТК_Взаимозачет
	               |ГДЕ
	               |	ТК_Взаимозачет.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период", 			Реквизиты.Период);
	Запрос.УстановитьПараметр("МоментВремени", 		Реквизиты.МоментВремени);
	Запрос.УстановитьПараметр("Ссылка", 			Реквизиты.Ссылка);
	Запрос.УстановитьПараметр("ВалютаДокумента",	Реквизиты.ВалютаДокумента);
	Запрос.УстановитьПараметр("ХозОперация", 		Реквизиты.ХозОперация);
	Запрос.УстановитьПараметр("РегламентированныйУчет", Реквизиты.РегламентированныйУчет);	
	Запрос.УстановитьПараметр("Дебитор",			Реквизиты.Дебитор);
	Запрос.УстановитьПараметр("Кредитор",			Реквизиты.Кредитор);
	//Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);	
	//Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	
	Запрос.УстановитьПараметр("ВидДоговораПокупка", ПредопределенноеЗначение("Перечисление.ВидыДоговоров.Покупка"));
	Запрос.УстановитьПараметр("ВидДоговораПродажа",	ПредопределенноеЗначение("Перечисление.ВидыДоговоров.Продажа"));

	ДополнительныеСвойства.ДляПроведения.Вставить("РегламентированныйУчет", Реквизиты.РегламентированныйУчет); 
	ДополнительныеСвойства.ДляПроведения.Вставить("КурсДокумента", Реквизиты.КурсДокумента); 
	ДополнительныеСвойства.ДляПроведения.Вставить("ХозОперация", Реквизиты.ХозОперация); 

КонецПроцедуры

Функция ТекстЗапросаВтТаблицаСостав(Запрос, ТекстыЗапроса)
	
	
	ИмяРегистра = "ВтТаблицаСостав";
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	&Дебитор КАК Дт_Контрагент,
	               |	&Кредитор КАК Кт_Контрагент,
	               |	ТК_ВзаимозачетСостав.ДоговорВзаиморасчетовДебитор КАК Дт_Договор,
	               |	ТК_ВзаимозачетСостав.ДоговорВзаиморасчетовДебитор.ВидДоговора.ВидДоговора = &ВидДоговораПокупка КАК Дт_Покупка,
	               |	ТК_ВзаимозачетСостав.ДоговорВзаиморасчетовКредитор КАК Кт_Договор,
	               |	ТК_ВзаимозачетСостав.ДоговорВзаиморасчетовКредитор.ВидДоговора.ВидДоговора = &ВидДоговораПокупка КАК Кт_Покупка,
	               |	ТК_ВзаимозачетСостав.СделкаДебитор КАК Дт_Сделка,
	               |	ТК_ВзаимозачетСостав.СделкаКредитор КАК Кт_Сделка,
	               |	СУММА(ТК_ВзаимозачетСостав.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ВтТаблицаСостав
	               |ИЗ
	               |	Документ.ТК_Взаимозачет.Состав КАК ТК_ВзаимозачетСостав
	               |ГДЕ
	               |	ТК_ВзаимозачетСостав.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТК_ВзаимозачетСостав.ДоговорВзаиморасчетовДебитор,
	               |	ТК_ВзаимозачетСостав.ДоговорВзаиморасчетовКредитор,
	               |	ТК_ВзаимозачетСостав.СделкаКредитор,
	               |	ТК_ВзаимозачетСостав.СделкаДебитор,
	               |	ТК_ВзаимозачетСостав.ДоговорВзаиморасчетовДебитор.ВидДоговора.ВидДоговора = &ВидДоговораПокупка,
	               |	ТК_ВзаимозачетСостав.ДоговорВзаиморасчетовКредитор.ВидДоговора.ВидДоговора = &ВидДоговораПокупка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти


#Область Последовательность

Процедура ИнициалзироватьДанныеПоследовательности(Ссылка,ДополнительныеСвойства) Экспорт
	
	ТаблицыДляПоследовательности = Новый Структура("Взаиморасчеты");	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТК_ВзаимозачетСостав.Ссылка КАК Регистратор,
	                      |	ТК_ВзаимозачетСостав.ДоговорВзаиморасчетовДебитор КАК ДоговорКонтрагента
	                      |ПОМЕСТИТЬ втДоговора
	                      |ИЗ
	                      |	Документ.ТК_Взаимозачет.Состав КАК ТК_ВзаимозачетСостав
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ТК_ВзаимозачетСостав.Ссылка,
	                      |	ТК_ВзаимозачетСостав.ДоговорВзаиморасчетовКредитор
	                      |ИЗ
	                      |	Документ.ТК_Взаимозачет.Состав КАК ТК_ВзаимозачетСостав
	                      |ГДЕ
	                      |	ТК_ВзаимозачетСостав.Ссылка = &Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	&Дата КАК Период,
	                      |	втДоговора.Регистратор КАК Регистратор,
	                      |	втДоговора.ДоговорКонтрагента КАК ДоговорКонтрагента
	                      |ИЗ
	                      |	втДоговора КАК втДоговора");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", ДополнительныеСвойства.ДляПроведения.Дата); 
		
	ТаблицыДляПоследовательности.Взаиморасчеты = Запрос.Выполнить().Выгрузить();
	
	ДополнительныеСвойства.Вставить("ТаблицыДляПоследовательности",ТаблицыДляПоследовательности);
	
КонецПроцедуры

#КонецОбласти	


#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	                                            
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ПодразделениеКомпании)
	|	И ЗначениеРазрешено(ТорговаяПлощадка)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти
